import React from "react";

import AboutUzbekistanHero from "../../components/aboutUzbekistanHero/AboutUzbekistanHero";
import AboutUzbekistanGallery from "../../components/aboutUzbekistanGallery/AboutUzbekistanGallery";
import View3D from "../../components/view3D/View3D";

import "./aboutUzbekistanHome.scss";

const AboutUzbekistanHome = () => {
  return (
    <div className="about-uzbekistan-home">
      <div className="container">
        <AboutUzbekistanHero />
        <div className="about-uzbekistan-home__open-uzbekistan">
          <h2 className="about-uzbekistan-title">
            Откройте для себя новый Узбекистан!
          </h2>
          <p>
            Сиз ва Сизнинг ходимларингизга узоқ вақт орзу қилган шаҳар ёки
            давлатларингиз бўйлаб энг арзон нарҳларда мароқли дам олиш ҳамда
            қулай бўлган вақтда айнан Сизлар учун ёқимли саёҳат турларини таклиф
            этади. Биз, касаба уюшмаларига ишонган ва унинг ҳаракатларини
            қўллаб-қувватлаган 6 000 000 нафардан кўпроқ меҳнаткашлар
            аудиториясига эгамиз! Буюк инглиз шоири Марк Твен вақт ўтгани сари
            ҳаётда биз икки нарсани афсус билан ёд этамиз деб ёзади, булар:
            ҳаётимизни жуда кам севганимиз ва жуда кам саёҳат қилганмиздир.
            “Kasaba sayr” туристик корхонаси билан Сиз бундай афсусларга батамом
            барҳам берасиз, зеро бизнинг шиоримиз: «Саёҳат қилинг, севинг,
            ҳаётнинг ҳар лаҳзасидан роҳатланинг!»
          </p>
        </div>
        <View3D />
        <AboutUzbekistanGallery />
        <div className="about-uzbekistan-home__bottom">
          <h2 className="about-uzbekistan-title">
            Откройте для себя новый Узбекистан!
          </h2>
          <p>
            Сиз ва Сизнинг ходимларингизга узоқ вақт орзу қилган шаҳар ёки
            давлатларингиз бўйлаб энг арзон нарҳларда мароқли дам олиш ҳамда
            қулай бўлган вақтда айнан Сизлар учун ёқимли саёҳат турларини таклиф
            этади. Биз, касаба уюшмаларига ишонган ва унинг ҳаракатларини
            қўллаб-қувватлаган 6 000 000 нафардан кўпроқ меҳнаткашлар
            аудиториясига эгамиз! Буюк инглиз шоири Марк Твен вақт ўтгани сари
            ҳаётда биз икки нарсани афсус билан ёд этамиз деб ёзади, булар:
            ҳаётимизни жуда кам севганимиз ва жуда кам саёҳат қилганмиздир.
            “Kasaba sayr” туристик корхонаси билан Сиз бундай афсусларга батамом
            барҳам берасиз, зеро бизнинг шиоримиз: «Саёҳат қилинг, севинг,
            ҳаётнинг ҳар лаҳзасидан роҳатланинг!»Сиз ва Сизнинг ходимларингизга
            узоқ вақт орзу қилган шаҳар ёки давлатларингиз бўйлаб энг арзон
            нарҳларда мароқли дам олиш ҳамда қулай бўлган вақтда айнан Сизлар
            учун ёқимли саёҳат турларини таклиф этади. Биз, касаба уюшмаларига
            ишонган ва унинг ҳаракатларини қўллаб-қувватлаган 6 000 000 нафардан
            кўпроқ меҳнаткашлар аудиториясига эгамиз! Буюк инглиз шоири Марк
            Твен вақт ўтгани сари ҳаётда биз икки нарсани афсус билан ёд этамиз
            деб ёзади, булар: ҳаётимизни жуда кам севганимиз ва жуда кам саёҳат
            қилганмиздир. “Kasaba sayr” туристик корхонаси билан Сиз бундай
            афсусларга батамом барҳам берасиз, зеро бизнинг шиоримиз: «Саёҳат
            қилинг, севинг, ҳаётнинг ҳар лаҳзасидан роҳатланинг!»
          </p>
        </div>
      </div>
    </div>
  );
};

export default AboutUzbekistanHome;
